Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: In the second version of the :class:`Noddy` example, we allowed any kind of object to be stored in the :attr:`first` or :attr:`last` attributes. [#]_ This means that :class:`Noddy` objects can participate in cycles::
pl: W drugiej wersji przykładu uogólnienia :class:`Noddy`, pozwoliliśmy dowolnego rodzaju przedmiotowi aby był zachowany we własnościach :attr:`imie` lub :attr:`nazwisko`. [#]_ To oznacza że przedmioty :class:`Noddy` mogą brać udział w cyklicznych odwołaniach::

source: This is pretty silly, but it gives us an excuse to add support for the cyclic-garbage collector to the :class:`Noddy` example. To support cyclic garbage collection, types need to fill two slots and set a class flag that enables these slots:
pl: To jest raczej głupie, ale daje nam wymówkę aby dodać wsparcie dla cyklicznej zbiórki śmieci do przykładu uogólnienia :class:`Noddy`. Aby wspierać cykliczną zbiórkę śmieci, typy potrzebują wypełniać dwa gniazda i ustawić flagę uogólnienia która włącza te gniazda:

source: #include <Python.h> #include "structmember.h" typedef struct { PyObject_HEAD PyObject *first; PyObject *last; int number; } Noddy; static int Noddy_traverse(Noddy *self, visitproc visit, void *arg) { int vret; if (self->first) { vret = visit(self->first, arg); if (vret != 0) return vret; } if (self->last) { vret = visit(self->last, arg); if (vret != 0) return vret; } return 0; } static int Noddy_clear(Noddy *self) { PyObject *tmp; tmp = self->first; self->first = NULL; Py_XDECREF(tmp); tmp = self->last; self->last = NULL; Py_XDECREF(tmp); return 0; } static void Noddy_dealloc(Noddy* self) { Noddy_clear(self); Py_TYPE(self)->tp_free((PyObject*)self); } static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->first = PyUnicode_FromString(""); if (self->first == NULL) { Py_DECREF(self); return NULL; } self->last = PyUnicode_FromString(""); if (self->last == NULL) { Py_DECREF(self); return NULL; } self->number = 0; } return (PyObject *)self; } static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *first=NULL, *last=NULL, *tmp; static char *kwlist[] = {"first", "last", "number", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &first, &last, &self->number)) return -1; if (first) { tmp = self->first; Py_INCREF(first); self->first = first; Py_XDECREF(tmp); } if (last) { tmp = self->last; Py_INCREF(last); self->last = last; Py_XDECREF(tmp); } return 0; } static PyMemberDef Noddy_members[] = { {"first", T_OBJECT_EX, offsetof(Noddy, first), 0, "first name"}, {"last", T_OBJECT_EX, offsetof(Noddy, last), 0, "last name"}, {"number", T_INT, offsetof(Noddy, number), 0, "noddy number"}, {NULL} /* Sentinel */ }; static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyUnicode_FromString("%s %s"); if (format == NULL) return NULL; } if (self->first == NULL) { PyErr_SetString(PyExc_AttributeError, "first"); return NULL; } if (self->last == NULL) { PyErr_SetString(PyExc_AttributeError, "last"); return NULL; } args = Py_BuildValue("OO", self->first, self->last); if (args == NULL) return NULL; result = PyUnicode_Format(format, args); Py_DECREF(args); return result; } static PyMethodDef Noddy_methods[] = { {"name", (PyCFunction)Noddy_name, METH_NOARGS, "Return the name, combining the first and last name" }, {NULL} /* Sentinel */ }; static PyTypeObject NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(Noddy), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)Noddy_dealloc, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE | Py_TPFLAGS_HAVE_GC, /* tp_flags */ "Noddy objects", /* tp_doc */ (traverseproc)Noddy_traverse, /* tp_traverse */ (inquiry)Noddy_clear, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Noddy_methods, /* tp_methods */ Noddy_members, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Noddy_init, /* tp_init */ 0, /* tp_alloc */ Noddy_new, /* tp_new */ }; static PyModuleDef noddy4module = { PyModuleDef_HEAD_INIT, "noddy4", "Example module that creates an extension type.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy4(void) { PyObject* m; if (PyType_Ready(&NoddyType) < 0) return NULL; m = PyModule_Create(&noddy4module); if (m == NULL) return NULL; Py_INCREF(&NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&NoddyType); return m; }
pl: #include <Python.h> #include "structmember.h" typedef struct { PyObject_HEAD PyObject *imie; PyObject *nazwisko; int numer; } Noddy; static int Noddy_traverse(Noddy *self, visitproc visit, void *arg) { int vret; if (self->imie) { vret = visit(self->imie, arg); if (vret != 0) return vret; } if (self->nazwisko) { vret = visit(self->nazwisko, arg); if (vret != 0) return vret; } return 0; } static int Noddy_clear(Noddy *self) { PyObject *tmp; tmp = self->imie; self->imie = NULL; Py_XDECREF(tmp); tmp = self->nazwisko; self->nazwisko = NULL; Py_XDECREF(tmp); return 0; } static void Noddy_dealloc(Noddy* self) { Noddy_clear(self); Py_TYPE(self)->tp_free((PyObject*)self); } static PyObject * Noddy_new(PyTypeObject *type, PyObject *args, PyObject *kwds) { Noddy *self; self = (Noddy *)type->tp_alloc(type, 0); if (self != NULL) { self->imie = PyUnicode_FromString(""); if (self->imie == NULL) { Py_DECREF(self); return NULL; } self->nazwisko = PyUnicode_FromString(""); if (self->nazwisko == NULL) { Py_DECREF(self); return NULL; } self->numer = 0; } return (PyObject *)self; } static int Noddy_init(Noddy *self, PyObject *args, PyObject *kwds) { PyObject *imie=NULL, *nazwisko=NULL, *tmp; static char *kwlist[] = {"imie", "nazwisko", "numer", NULL}; if (! PyArg_ParseTupleAndKeywords(args, kwds, "|OOi", kwlist, &imie, &nazwisko, &self->numer)) return -1; if (imie) { tmp = self->imie; Py_INCREF(imie); self->imie = imie; Py_XDECREF(tmp); } if (nazwisko) { tmp = self->nazwisko; Py_INCREF(nazwisko); self->nazwisko = nazwisko; Py_XDECREF(tmp); } return 0; } static PyMemberDef Noddy_members[] = { {"imie", T_OBJECT_EX, offsetof(Noddy, imie), 0, "imie"}, {"nazwisko", T_OBJECT_EX, offsetof(Noddy, last), 0, "nazwisko"}, {"numer", T_INT, offsetof(Noddy, numer), 0, "numer noddy"}, {NULL} /* Ochrona */ }; static PyObject * Noddy_name(Noddy* self) { static PyObject *format = NULL; PyObject *args, *result; if (format == NULL) { format = PyUnicode_FromString("%s %s"); if (format == NULL) return NULL; } if (self->imie == NULL) { PyErr_SetString(PyExc_AttributeError, "imie"); return NULL; } if (self->nazwisko == NULL) { PyErr_SetString(PyExc_AttributeError, "nazwisko"); return NULL; } args = Py_BuildValue("OO", self->imie, self->nazwisko); if (args == NULL) return NULL; result = PyUnicode_Format(format, args); Py_DECREF(args); return result; } static PyMethodDef Noddy_methods[] = { {"nazwisko", (PyCFunction)Noddy_name, METH_NOARGS, "Zwróć nazwisko, sklejając imię i nazwisko" }, {NULL} /* Ochrona */ }; static PyTypeObject NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(Noddy), /* tp_basicsize */ 0, /* tp_itemsize */ (destructor)Noddy_dealloc, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE | Py_TPFLAGS_HAVE_GC, /* tp_flags */ "przedmioty Noddy", /* tp_doc */ (traverseproc)Noddy_traverse, /* tp_traverse */ (inquiry)Noddy_clear, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Noddy_methods, /* tp_methods */ Noddy_members, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Noddy_init, /* tp_init */ 0, /* tp_alloc */ Noddy_new, /* tp_new */ }; static PyModuleDef noddy4module = { PyModuleDef_HEAD_INIT, "noddy4", "Przykładowy moduł który tworzy typ rozszerzający.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy4(void) { PyObject* m; if (PyType_Ready(&NoddyType) < 0) return NULL; m = PyModule_Create(&noddy4module); if (m == NULL) return NULL; Py_INCREF(&NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&NoddyType); return m; }

source: The traversal method provides access to subobjects that could participate in cycles::
pl: Sposób postępowania trawersujący dostarcza dostęp do podrzędnych przedmiotów które mogą brać udział w cyklach::

source: static int Noddy_traverse(Noddy *self, visitproc visit, void *arg) { int vret; if (self->first) { vret = visit(self->first, arg); if (vret != 0) return vret; } if (self->last) { vret = visit(self->last, arg); if (vret != 0) return vret; } return 0; }
pl: static int Noddy_traverse(Noddy *self, visitproc visit, void *arg) { int vret; if (self->imie) { vret = visit(self->imie, arg); if (vret != 0) return vret; } if (self->nazwisko) { vret = visit(self->nazwisko, arg); if (vret != 0) return vret; } return 0; }

source: For each subobject that can participate in cycles, we need to call the :cfunc:`visit` function, which is passed to the traversal method. The :cfunc:`visit` function takes as arguments the subobject and the extra argument *arg* passed to the traversal method. It returns an integer value that must be returned if it is non-zero.
pl: Dla każdego podrzędnego przedmiotu który może brać udział w cyklach, potrzebujemy wezwać zadanie :cfunc:`visit`, które jest przekazywane do sposobu postępowania trawersującego. Zadanie :cfunc:`visit` pobiera jako parametry podrzędne przedmioty i dodatkowy parametr *arg* przekazywany do zadania trawersującego. Zwraca liczbę całkowitą która musi być zwrócona jeśli jest nie-zerowa.

source: Python provides a :cfunc:`Py_VISIT` macro that automates calling visit functions. With :cfunc:`Py_VISIT`, :cfunc:`Noddy_traverse` can be simplified::
pl: Język pytonowski dostarcza makropolecenie :cfunc:`Py_VISIT` które automatyzuje wzywania zadania wizytowania. Za pomocą :cfunc:`Py_VISIT` zadanie :cfunc:`Noddy_traverse` może zostać uproszczona::

source: static int Noddy_traverse(Noddy *self, visitproc visit, void *arg) { Py_VISIT(self->first); Py_VISIT(self->last); return 0; }
pl: static int Noddy_traverse(Noddy *self, visitproc visit, void *arg) { Py_VISIT(self->imie); Py_VISIT(self->nazwisko); return 0; }

source: Note that the :attr:`tp_traverse` implementation must name its arguments exactly *visit* and *arg* in order to use :cfunc:`Py_VISIT`. This is to encourage uniformity across these boring implementations.
pl: Zauważ, że wypełnienie własności :attr:`tp_traverse` musi nazywać swoje argumenty dokładnie *visit* i *arg* w celu użycia zadania :cfunc:`Py_VISIT`. To jest w celu zachęcenia do jednakowości pośród tych nudnych wypełnień.

source: We also need to provide a method for clearing any subobjects that can participate in cycles. We implement the method and reimplement the deallocator to use it::
pl: My także potrzebujemy dostarczyć sposób postępowania dla czyszczenia podrzędnych przedmiotów które mogą brać udział w cyklach. Wypełniamy sposób postępowania i ponownie wypełniamy sposób postępowania uwalniający pamięć aby go użyć::

source: static int Noddy_clear(Noddy *self) { PyObject *tmp; tmp = self->first; self->first = NULL; Py_XDECREF(tmp); tmp = self->last; self->last = NULL; Py_XDECREF(tmp); return 0; } static void Noddy_dealloc(Noddy* self) { Noddy_clear(self); Py_TYPE(self)->tp_free((PyObject*)self); }
pl: static int Noddy_clear(Noddy *self) { PyObject *tmp; tmp = self->imie; self->imie = NULL; Py_XDECREF(tmp); tmp = self->nazwisko; self->nazwisko = NULL; Py_XDECREF(tmp); return 0; } static void Noddy_dealloc(Noddy* self) { Noddy_clear(self); Py_TYPE(self)->tp_free((PyObject*)self); }

source: Notice the use of a temporary variable in :cfunc:`Noddy_clear`. We use the temporary variable so that we can set each member to *NULL* before decrementing its reference count. We do this because, as was discussed earlier, if the reference count drops to zero, we might cause code to run that calls back into the object. In addition, because we now support garbage collection, we also have to worry about code being run that triggers garbage collection. If garbage collection is run, our :attr:`tp_traverse` handler could get called. We can't take a chance of having :cfunc:`Noddy_traverse` called when a member's reference count has dropped to zero and its value hasn't been set to *NULL*.
pl: Zauważ użycie tymczasowej zmiennej w :cfunc:`Noddy_clear`. Używamy zmiennej tymczasowej tak aby móc ustawić każdego członka na *NULL* zanim zmniejszymy jego liczbę odniesień. Robimy to dlatego, że, jak wyjaśniono wcześniej, jeśli liczba odniesień spadnie do zera, moglibyśmy spowodować, że kod uruchomiłby się, który wywołuje wstecz do wnętrza przedmiotu. W dodatku, ponieważ my teraz wspieramy zbieranie śmieci, musimy także martwić się o kod który uruchamia się i wyzwala zbieranie śmieci. Jeśli zbieranie śmieci zostanie uruchomione, nasza obsługa :attr:`tp_traverse` mogłaby być wywołana. Nie możemy ryzykować wywołania :cfunc:`Noddy_traverse` gdy liczba odniesień do członka spadła do zera i jego wartość nie została ustawiona na *NULL*.

source: Python provides a :cfunc:`Py_CLEAR` that automates the careful decrementing of reference counts. With :cfunc:`Py_CLEAR`, the :cfunc:`Noddy_clear` function can be simplified::
pl: Python dostarcza zadanie :cfunc:`Py_CLEAR` które automatyzuje ostrożne zmniejszanie liczby odniesień. Z zadaniem :cfunc:`Py_CLEAR`, zadanie :cfunc:`Noddy_clear` może zostać uproszczone::

source: static int Noddy_clear(Noddy *self) { Py_CLEAR(self->first); Py_CLEAR(self->last); return 0; }
pl: static int Noddy_clear(Noddy *self) { Py_CLEAR(self->imie); Py_CLEAR(self->nazwisko); return 0; }

source: Finally, we add the :const:`Py_TPFLAGS_HAVE_GC` flag to the class flags::
pl: Ostatecznie dodajemy flagę :const:`Py_TPFLAGS_HAVE_GC` do flag uogólnienia::

source: That's pretty much it. If we had written custom :attr:`tp_alloc` or :attr:`tp_free` slots, we'd need to modify them for cyclic-garbage collection. Most extensions will use the versions automatically provided.
pl: To z grubsza wszystko. Jeśli napisalibyśmy szczególne sposoby postępowania :attr:`tp_alloc` lub :attr:`tp_free` w gniazdach, potrzebowalibyśmy zmodyfikować je dla cyklicznego zbierania śmieci. Większość rozszerzeń będzie używać wersji dostarczonych automatycznie.

source: Subclassing other types
pl: Tworzenie podrzędnych uogólnień innych typów

source: It is possible to create new extension types that are derived from existing types. It is easiest to inherit from the built in types, since an extension can easily use the :class:`PyTypeObject` it needs. It can be difficult to share these :class:`PyTypeObject` structures between extension modules.
pl: Jest możliwe tworzenie nowych typów rozszerzeń które są pochodnymi istniejących typów. Najłatwiej jest dziedziczyć z typów wbudowanych od kiedy rozszerzenie może łatwo używać uogólnienia :class:`PyTypeObject`, którego potrzebuje. Może być trudno dzielić struktury uogólnienia :class:`PyTypeObject` pomiędzy moduły rozszerzające.

source: In this example we will create a :class:`Shoddy` type that inherits from the built-in :class:`list` type. The new type will be completely compatible with regular lists, but will have an additional :meth:`increment` method that increases an internal counter. ::
pl: W tym przykładzie utworzymy typ uogólnienie :class:`Shoddy` który będzie dziedziczył po wbudowanych typach uogólnienia :class:`list`. Nowy typ będzie kompletnie zgodny z regularnymi listami, ale będzie miał dodatkowy sposób postępowania :meth:`increment` który zwiększa wewnętrzny licznik. ::

source: #include <Python.h> typedef struct { PyListObject list; int state; } Shoddy; static PyObject * Shoddy_increment(Shoddy *self, PyObject *unused) { self->state++; return PyLong_FromLong(self->state); } static PyMethodDef Shoddy_methods[] = { {"increment", (PyCFunction)Shoddy_increment, METH_NOARGS, PyDoc_STR("increment state counter")}, {NULL, NULL}, }; static int Shoddy_init(Shoddy *self, PyObject *args, PyObject *kwds) { if (PyList_Type.tp_init((PyObject *)self, args, kwds) < 0) return -1; self->state = 0; return 0; } static PyTypeObject ShoddyType = { PyObject_HEAD_INIT(NULL) "shoddy.Shoddy", /* tp_name */ sizeof(Shoddy), /* tp_basicsize */ 0, /* tp_itemsize */ 0, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, /* tp_flags */ 0, /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Shoddy_methods, /* tp_methods */ 0, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Shoddy_init, /* tp_init */ 0, /* tp_alloc */ 0, /* tp_new */ }; static PyModuleDef shoddymodule = { PyModuleDef_HEAD_INIT, "shoddy", "Shoddy module", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_shoddy(void) { PyObject *m; ShoddyType.tp_base = &PyList_Type; if (PyType_Ready(&ShoddyType) < 0) return NULL; m = PyModule_Create(&shoddymodule); if (m == NULL) return NULL; Py_INCREF(&ShoddyType); PyModule_AddObject(m, "Shoddy", (PyObject *) &ShoddyType); return m; }
pl: #include <Python.h> typedef struct { PyListObject list; int stan; } Shoddy; static PyObject * Shoddy_increment(Shoddy *self, PyObject *unused) { self->stan++; return PyLong_FromLong(self->stan); } static PyMethodDef Shoddy_methods[] = { {"increment", (PyCFunction)Shoddy_increment, METH_NOARGS, PyDoc_STR("zwiększ licznik stanu")}, {NULL, NULL}, }; static int Shoddy_init(Shoddy *self, PyObject *args, PyObject *kwds) { if (PyList_Type.tp_init((PyObject *)self, args, kwds) < 0) return -1; self->stan = 0; return 0; } static PyTypeObject ShoddyType = { PyObject_HEAD_INIT(NULL) "shoddy.Shoddy", /* tp_name */ sizeof(Shoddy), /* tp_basicsize */ 0, /* tp_itemsize */ 0, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT | Py_TPFLAGS_BASETYPE, /* tp_flags */ 0, /* tp_doc */ 0, /* tp_traverse */ 0, /* tp_clear */ 0, /* tp_richcompare */ 0, /* tp_weaklistoffset */ 0, /* tp_iter */ 0, /* tp_iternext */ Shoddy_methods, /* tp_methods */ 0, /* tp_members */ 0, /* tp_getset */ 0, /* tp_base */ 0, /* tp_dict */ 0, /* tp_descr_get */ 0, /* tp_descr_set */ 0, /* tp_dictoffset */ (initproc)Shoddy_init, /* tp_init */ 0, /* tp_alloc */ 0, /* tp_new */ }; static PyModuleDef shoddymodule = { PyModuleDef_HEAD_INIT, "shoddy", "Moduł shoddy", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_shoddy(void) { PyObject *m; ShoddyType.tp_base = &PyList_Type; if (PyType_Ready(&ShoddyType) < 0) return NULL; m = PyModule_Create(&shoddymodule); if (m == NULL) return NULL; Py_INCREF(&ShoddyType); PyModule_AddObject(m, "Shoddy", (PyObject *) &ShoddyType); return m; }

source: As you can see, the source code closely resembles the :class:`Noddy` examples in previous sections. We will break down the main differences between them. ::
pl: Jak widać, kod źródłowy blisko przypomina przykład uogólnienia :class:`Noddy` z poprzednich rozdziałów. Podzielimy główne różnice pomiędzy nimi. ::

source: typedef struct { PyListObject list; int state; } Shoddy;
pl: typedef struct { PyListObject list; int stan; } Shoddy;

source: The primary difference for derived type objects is that the base type's object structure must be the first value. The base type will already include the :cfunc:`PyObject_HEAD` at the beginning of its structure.
pl: Główna różnica dla odziedziczonych przedmiotów typu jest tym że struktura przedmiotu typu bazowego musi być pierwszą wartością. Typ bazowy będzie już zawierał :cfunc:`PyObject_HEAD` na początku struktury.

source: When a Python object is a :class:`Shoddy` instance, its *PyObject\** pointer can be safely cast to both *PyListObject\** and *Shoddy\**. ::
pl: Gdy przedmiot języka pytonowskiego jest przykładem uogólnienia :class:`Shoddy`, jego wskaźnik *PyObject\** może być bezpiecznie zrzutować na zarówno *PyListObject\** i *Shoddy\**. ::

source: static int Shoddy_init(Shoddy *self, PyObject *args, PyObject *kwds) { if (PyList_Type.tp_init((PyObject *)self, args, kwds) < 0) return -1; self->state = 0; return 0; }
pl: static int Shoddy_init(Shoddy *self, PyObject *args, PyObject *kwds) { if (PyList_Type.tp_init((PyObject *)self, args, kwds) < 0) return -1; self->stan = 0; return 0; }

source: In the :attr:`__init__` method for our type, we can see how to call through to the :attr:`__init__` method of the base type.
pl: W sposobie postępowania :attr:`__init__` dla naszego typu, możemy zobaczyć jak wywołać sposób postępowania :attr:`__init__` typu bazowego.

source: This pattern is important when writing a type with custom :attr:`new` and :attr:`dealloc` methods. The :attr:`new` method should not actually create the memory for the object with :attr:`tp_alloc`, that will be handled by the base class when calling its :attr:`tp_new`.
pl: Ten wzorzec jest istotny gdy pisze się typ z szczególnym wypełnieniem sposobów postępowania :attr:`new` i :attr:`dealloc`. Sposób postępowania :attr:`new` nie powinien właściwie tworzyć pamięci dla przedmiotu z :attr:`tp_alloc`, który będzie obsługiwany przez uogólnienie bazowe gdy wywoływany będzie jego sposób postępowania :attr:`tp_new`

source: When filling out the :cfunc:`PyTypeObject` for the :class:`Shoddy` type, you see a slot for :cfunc:`tp_base`. Due to cross platform compiler issues, you can't fill that field directly with the :cfunc:`PyList_Type`; it can be done later in the module's :cfunc:`init` function. ::
pl: Gdy wypełniany jest :cfunc:`PyTypeObject` dla typu :class:`Shoddy`, zobaczysz gniazdo dla :cfunc:`tp_base`. W związku z problemami krzyżowej kompilacji na różnych maszynach/środowiskach, nie możesz wypełnić tego pola bezpośrednio za pomocą :cfunc:`PyList_Type`; można to zrobić później w zadaniu inicjującym modułu :cfunc:`init`. ::

source: Before calling :cfunc:`PyType_Ready`, the type structure must have the :attr:`tp_base` slot filled in. When we are deriving a new type, it is not necessary to fill out the :attr:`tp_alloc` slot with :cfunc:`PyType_GenericNew` -- the allocate function from the base type will be inherited.
pl: Przed wywołaniem :cfunc:`PyType_Ready`, struktura typu musi mieć gniazdo :attr:`tp_base` zapełnione. Gdy nowy typ pochodzi od istniejącego, nie jest konieczne wypełnianie gniazda :attr:`tp_alloc` za pomocą :cfunc:`PyType_GenericNew` -- zadanie umieszczania w pamięci zostanie odziedziczone po typie bazowym.
